public class Main {
    public static void main(String[] args) {

        /**
         * 1.     Что такое модификаторы доступа и зачем они нужны?
         *  модификаторы доступа это ыдовражыодрваэдлывжа
         *
         *  2.     Какие бывают модификаторы доступа?
         *  бывают ывдлоардыловрпдыловрпдыловрпд
         */
    }
}


/*
Задача A.Студенты
К предыдущей домашней работе со студентами добавить:
•	Структурировать код Студент-Курсы, разбить проект по пакетам
•	Проставить модификаторы доступа, если они еще не установлены
Задача B. Вопросы и Ответы
Ответьте на вопросы своими словами:
1.     Что такое модификаторы доступа и зачем они нужны?
2.     Какие бывают модификаторы доступа?
3.     Что такое package, для чего они нужны?
4.     В чем отличие между default и public?
5.     Зачем делать сеттер private а геттер public, что это нам даст?

 */
